app/views/visitors/index.html.erb


<p><%= link_to 'Users:', users_path %> <%= User.count %> registered</p>

<p><%= link_to 'Accounts:', accounts_path %> <%= Account.count %> registered</p>
---
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "accounts"