app/controllers/accounts_controller.rb

  def index
    if params[:user_id]
      @accounts = Account.where("user_id = ?", params[:user_id])
      user = User.find(params[:user_id])
      authorize user
    else
      @accounts = Account.all
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts"

  def show
    @account = Account.find(params[:id])
    @transactions = Transaction.all
    user = User.find(@account.user_id)
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def new
    @account = Account.new
    @account.user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save
        format.html { redirect_to @account, notice: 'Account was successfully created.' }
        format.json { render :show, status: :created, location: @account }
      else
        format.html { render :new }
        format.json { render json: @account.errors, status: :unprocessable_entity }
      end
    end

    user = User.find(@account.user_id)
---
INSERT INTO "accounts" ("number", "status", "balance", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["number", 123], ["status", 0], ["balance", 0.0], ["user_id", 3], ["created_at", 2017-02-11 20:01:29 UTC], ["updated_at", 2017-02-11 20:01:29 UTC]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    respond_to do |format|
      if @account.update(account_params)
---
UPDATE "accounts" SET "number" = ?, "status" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["number", 1], ["status", "closed"], ["updated_at", 2017-02-12 00:48:15 UTC], ["id", 1]]