app/controllers/transactions_controller.rb

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @transaction = Transaction.find(params[:id])

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def new
    @transaction = Transaction.new
    @account = Account.find(params[:account_id])

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "transactions" ("kind", "amount", "status", "from", "to", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["kind", "deposit"], ["amount", 50.0], ["status", "pending"], ["from", 2], ["to", 3], ["account_id", 1], ["created_at", 2017-02-12 03:15:37 UTC], ["updated_at", 2017-02-12 03:15:37 UTC]]
---
  def create
    @transaction = Transaction.new(transaction_params)
    @account = Account.find(@transaction.account_id)

    if @transaction.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
          @transaction.status = 'approved'
          @transaction.processed = true
          @transaction.save
          sender = User.find(Account.find(@transaction.from).user_id)

DELETE FROM "transactions" WHERE "transactions"."id" = ?  [["id", 12]]
---
  def destroy
    account = Account.find(@transaction.account_id)
    @transaction.destroy