app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 1], ["updated_at", 2017-02-13 02:31:22 UTC], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    authorize @user
    if @user.update_attributes(secure_params)