app/views/transactions/_newform.html.erb

   friends.each do |f|
     Account.all.each do |a|
---
SELECT "accounts".* FROM "accounts"

          <%= d.label "To Account" %>
          <%= select('transaction', 'account_id', Account.where("user_id = ?", current_user.id).collect{
              |a| ["#{current_user.name} #{sprintf("%09d",a.id)}", a.id]}, include_blank: true) %>
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

      <%= t.label "To Friend" %>
      <%= select('transaction', 'to', friend_accounts.collect{
          |fa| ["#{User.find(Account.find(fa).user_id).name} #{sprintf("%09d",fa)}", fa] }, include_blank: true) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]