app/views/transactions/_newform.html.erb

SELECT "users".* FROM "users"
---
        <%= f.label :from %>
        <%= select('transaction', 'from', User.all.collect{ |c| [ c.name, c.id] }) %>