app/views/transactions/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  <%= if @transaction.from
        "#{User.find(Account.find(@transaction.from).user_id).name} #{sprintf("%09d",@transaction.from)}"