app/views/accounts/_form.html.erb

SELECT "users".* FROM "users"
---
      <%= f.label :user %><br />
      <%= select("account", "user_id", User.all.collect{ |c| [ c.name, c.id] }) %>