app/views/accounts/_newform.html.erb

      <%= f.label :user %><br />
      <%= select('account', 'user_id', User.all.collect{ |c| [ c.name, c.id] }) %>
---
SELECT "users".* FROM "users"