app/views/accounts/index.html.erb

          <tr>
            <td><%= User.find(account.user_id).name %> </td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]