app/views/accounts/show.html.erb

          <td><%= link_to 'Edit', edit_transaction_path(transaction) %></td>
        <% elsif transaction.kind == 'borrow' and Account.find(transaction.from).user_id == current_user.id and transaction.status == 'pending' %>
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]